activities-cases/insert-payment.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--Insert Payment-->
<ns34:Envelope 
  xmlns:ns29="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/Common/DebitInformation" 
  xmlns:ns25="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/ConsentUpdates/ConsentUpdatesAsync" 
  xmlns:ns26="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/UpdatePayment/UpadtePaymentResSync" 
  xmlns:ns27="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/GetPaymentHistory/GetPaymentHistoryResBOD" 
  xmlns:ns28="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/Common/CustomerInformation" 
  xmlns:ns21="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/AccountUpdates/AccountUpdatesAsync" 
  xmlns:ns22="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/CustomerActivity/CustomerActivityBOD" 
  xmlns:ns23="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/CustomerActivity/CustomerActivityAsync" 
  xmlns:ns24="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/ConsentUpdates/ConsentUpdatesBOD" 
  xmlns:ns20="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/AccountUpdates/AccountUpdatesBOD" 
  xmlns:ns16="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/ValidateRoutingNum/IsValidRoutingNumResSync" 
  xmlns:ns17="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/InsertPayment/InsertPaymentResBOD" 
  xmlns:ns14="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/UpdatePayment/UpdatePaymentResBOD" 
  xmlns:ns15="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/Common/ResultBOD" 
  xmlns:ns18="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/InsertPayment/InsertPaymentResSync" 
  xmlns:ns19="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/DeletePayment/DeletePaymentResSync" 
  xmlns:ns34="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:ns9="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/UpdatePayment/UpdatePaymentReqSync" 
  xmlns:ns32="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/Common/ProcessedPaymentInformation" 
  xmlns:ns33="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/GetPaymentHistory/GetPaymentHistoryResSync" 
  xmlns:ns30="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/Common/PaymentInformation" 
  xmlns:ns12="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/GetPaymentHistory/GetPaymentHistoryReqBOD" 
  xmlns:ns5="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/ValidateRoutingNum/IsValidRoutingNumReqBOD" 
  xmlns:ns31="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/Common/PaymentProcessingDirections" 
  xmlns:ns13="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/GetPaymentHistory/GetPaymentHistoryReqSync" 
  xmlns:ns6="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/ValidateRoutingNum/IsValidRoutingNumReqSync" 
  xmlns:ns10="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/DeletePayment/DeletePaymentReqBOD" 
  xmlns:ns7="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/UpdatePayment/UpdatePaymentReqBOD" 
  xmlns:ns11="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/DeletePayment/DeletePaymentReqSync" 
  xmlns:ns8="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/UpdatePayment/UpdatePaymentReqBOD" 
  xmlns:ns2="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/InsertPayment/InsertPaymentReqBOD" 
  xmlns:ns4="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/InsertPayment/InsertPaymentReqSync" 
  xmlns:ns3="http://www.tfs.com/TFS/SharedComponents/ServiceSchemas/Common/ServiceApplicationArea">
    <ns34:Body>
        <ns4:InsertPaymentReqSync>
            <ns4:ProcessService>
                <ns2:InsertPaymentReqBOD>
                    <ns2:Payment>
                        <ns2:CustomerInformation>
                            <ns2:CreditAccount>002-6731731</ns2:CreditAccount>
                        </ns2:CustomerInformation>
                        <ns2:DebitInformation>
                            <ns2:PaymentType>ACH</ns2:PaymentType>
                            <ns2:DebitRouting>322280058</ns2:DebitRouting>
                            <ns2:DebitAccount>350738</ns2:DebitAccount>
                            <ns2:ExpDate>2020-04-27T16:06:21.052-07:00</ns2:ExpDate>
                            <ns2:TransType>CHECKING</ns2:TransType>
                            <ns2:SkipCCOverATM>false</ns2:SkipCCOverATM>
                        </ns2:DebitInformation>
                        <ns2:PaymentInformation>
                            <ns2:ScheduledPaymentDate>2020-11-10T00:00:00.000Z</ns2:ScheduledPaymentDate>
                            <ns2:PaymentAmount>990.00</ns2:PaymentAmount>
                            <ns2:FeeAmount>0.00</ns2:FeeAmount>
                            <ns2:SpeedPayFeeChargeType>INCLUDED</ns2:SpeedPayFeeChargeType>
                            <ns2:CollectorId>CLICKTPAY</ns2:CollectorId>
                            <ns2:CollectorGroup>CTP</ns2:CollectorGroup>
                        </ns2:PaymentInformation>
                        <ns2:PaymentProcessingDirections>
                            <ns2:CreditSiteId>CLEC</ns2:CreditSiteId>
                            <ns2:CreditInstId>CLEC</ns2:CreditInstId>
                            <ns2:PayeeCode>CLEC</ns2:PayeeCode>
                            <ns2:ReferenceID></ns2:ReferenceID>
                        </ns2:PaymentProcessingDirections>
                    </ns2:Payment>
                </ns2:InsertPaymentReqBOD>
                <ns3:ServiceApplicationArea>
                    <ns3:ConversationID>1588028781052</ns3:ConversationID>
                    <ns3:MessageType>Insert Payment Request</ns3:MessageType>
                    <ns3:Mode>SYNC</ns3:Mode>
                    <ns3:RefToSequenceNo></ns3:RefToSequenceNo>
                    <ns3:SenderID>C2P</ns3:SenderID>
                    <ns3:SentTimeStamp>2020-04-27T16:06:21.052-07:00</ns3:SentTimeStamp>
                    <ns3:SequenceNo>1</ns3:SequenceNo>
                    <ns3:ServiceType>Request</ns3:ServiceType>
                    <ns3:TargetID>WU</ns3:TargetID>
                    <ns3:VersionNo>1588028781052</ns3:VersionNo>
                </ns3:ServiceApplicationArea>
            </ns4:ProcessService>
        </ns4:InsertPaymentReqSync>
    </ns34:Body>
</ns34:Envelope>


